Teoria_da_Computacao/Trabalho/Trabalho1/pl0/pl0.org
#+title: Interpretador PL/0 em Clojure
#+subtitle: Teoria da Computação/Linguagens Formais e Autômatos
#+author: Prof. Dr. Jefferson O. Andrade
#+email: jefferson.andrade@ifes.edu.br
#+date: 2023/2
#+latex_compiler: lualatex
#+latex_class: koma-notes
#+latex_header:\usepackage{fvextra}
#+latex_header:\fvset{breakbefore=(}
#+latex_header:\usepackage{syntax}
# #+latex_header:\setsansfont{DejaVu Sans}
# #+latex_header:\setmonofont[Scale=MatchLowercase]{DejaVu Sans Mono}
#+property: header-args :eval never-export
#+property:clojure: header-args :exports both
#+options: toc:nil ^:{} _:{}


* Introdução

Este arquivo descreve a implementação de um interpretador para a [[https://en.wikipedia.org/wiki/PL/0][Linguagem PL/0]].
O interpretador descrito aqui considera a versão revisada da linguagem que
inclui primitivas para entrada e saída de dados, representadas pelos símbolos
*“?”* e *“!”*, respectivamente.

Além disso, é importante notar que este arquivo está sendo gerado pelo sistemas
[[https://orgmode.org/][Org Mode]] do editor de textos [[https://www.gnu.org/software/emacs/][GNU Emacs]] -- ou simplesmente /Emacs/ -- e o código
fonte Clojure será gerado extraindo-se os blocos de código deste arquivo[fn:2].
Ou seja, para facilitar o entendimento do código estamos utilizando uma técnica
chamada [[https://en.wikipedia.org/wiki/Literate_programming][programação literada]] (/“literate programming”/ em inglês). Por esse
motivo, começamos declarando o /namespace/ e as bibliotecas que serão
utilizadas.

#+begin_src clojure -n :tangle ./src/ifes/pl0/core.clj
  (ns ifes.pl0.core
    (:require [instaparse.core :as insta]
              [clojure.core.match :refer [match]]))
#+end_src


* Gramática da Linguagem PL/0

Para processar os caracteres (texto) de entrada na linguagem PL/0 será usada a
biblioteca [[https://github.com/Engelberg/instaparse][Instaparse]]. Esta biblioteca lê a definição da gramática em formato
EBNF e gera uma função que recebe um texto, processa esse texto de acordo com as
definições da gramática e gera o /Abstract Syntax Tree/ (AST) correspondente.

Para a linguagem PL/0 foi gerado o arquivo de gramática
~$PRJ/resources/pl0.bnf~[fn:1], mostrado abaixo:

#+name: src:pl0.bnf
#+include: "./resources/pl0.bnf" src ebnf -n

Para poder lidar com espaços em branco e comentários nos arquivos de entrada
PL/0, é necessário definir uma gramática à parte -- e mais tarde um parser
separado. A gramática para espaços em branco e comentários foi definida no
arquivo ~$PRJ/resources/pl0-ws.bnf~ e é dada abaixo.

#+name: src:pl0ws.bnf
#+include: "./resources/pl0-ws.bnf" src ebnf -n

Consulte a documentação do Instaparse para uma descrição detalhada de como
definir gramáticas.


* Definição do Parser da Linguagem PL/0

Uma vez que a gramática esteja definida, podemos usar a função ~parser~ do
pacote Instaparse para construir uma função que fará a análise sintática
(/parsing/) dos códigos em PL/0. Entretanto, primeiro precisamos construir o
parser para lidar com espaços em branco e comentários e só depois podemos
construir o parser principal.

#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (def whitespace-or-comment
    "Parser que se encarrega de identificar os espaços em branco e comentários do
    código fonte."
    (insta/parser (clojure.java.io/resource "pl0-ws.bnf")))

  (def parser
    "Parser que reconhece o código fonte da linguagem PL/0. Note que o parser
    `whitespace-or-comment` é passado para a opção `:auto-whitespace`."
    (insta/parser (clojure.java.io/resource "pl0.bnf")
                  :auto-whitespace whitespace-or-comment))
#+end_src

Note que na criação do analisador sintático principal, ~parser~, foi passada a
opção ~:auto-whitespace whitespace-or-comment~, que instrui o criador do
analisador sintático a usar o analisador sintático secundário
~whitespace-or-comments~ para lidar com espaços em branco.


* Estruturas de Dados do Interpretador PL/0

** Abstract Syntax Tree

O /Abstract Syntax Tree/ da linguagem PL/0 foi implicitamente definido ao se
definir a gramática da linguagem[fn:3]. Se temos, por exemplo, uma regra de
produção que diz:
#+begin_src ebnf :tangle no
assign = variable "<-" number ";" .
#+end_src
E o parser criado à partir dessa gramática recebe a cadeia de entrada ="x <-
10"=, então a estrutura de dados que será retornada é:
#+begin_src clojure :tangle no
[:assign [:variable "x"] "<-" [:number "10"] ";"]
#+end_src
Como relação a isso, o máximo de controle que se tem é dizer que alguns símbolos
podem ser descartados. Por exemplo, os símbolos ="<-"= e =";"= na regra de
produção acima tem função apenas sintática, sem nenhuma importância semântica.
Podem ser descartados sem nenhuma perda de informação. A sinalização de que um
símbolo pode ser descartado é feita através de parênteses angulares.
#+begin_src ebnf :tangle no
assign = variable <"<-"> number <";"> .
#+end_src
Nesta nova gramática a estrutura de dados retornada é:
#+begin_src clojure :tangle no
[:assign [:variable "x"] [:number "10"]]
#+end_src


