Teoria_da_Computacao/Trabalho/Trabalho1/pl0/pl0.org
** Ambiente de Execução

Para o interpretador funcionar adequadamente não é suficiente ter o AST
representando o código fonte em PL/0 que foi passado. É necessário ter algum
meio de manter registro do comportamênto dinâmico do programa. Ou seja, de como
o estado do programa evolui com o tempo.

Toda variável, toda constante, toda função ou procedimento que são definidos no
programa PL/0 precisam estar “guardados” em alguma estutura de dados para que o
interpretador tenha acesso a essas definições quando for necessário para
interpretar algum código. Mais ainda, é necessário que exista uma forma de
isolar algumas definições de outras.

Por exemplo, se temos um procedimento =p1= e outro procedimento =p2=, não
podemos deixar que =p1= acesse as var iáveis declaradas em =p2= e vice-versa.
Mas tanto =p1= quanto =p2= precisam ter acesso às variáveis declaradas no
programa principal. De modo mais concreto, considere o código PL/0 abaixo:

#+begin_src pascal -n :tangle no
  var ret, arg, acc;
  procedure p1;
  var x;
  begin
     x := arg;
     ret := x / 3
  end;
  procedureprocedure p2;
  var y;
  begin
     y := arg;
     ret := y * 2;
  end;
  begin
     ?arg;
     acc := 0;
     p1;
     acc := acc + ret;
     p2;
     acc := acc + ret;
     !acc
  end.
#+end_src

É necessário que tanto =p1= quanto =p2= tenham acesso a =arg= e a =ret=, mas
=p1= não pode ter acesso a =y= e =p2= não pode ter acesso a =x=. E no program a
principal não deve ser possível acessar nem =x= e nem =y=.

A forma mais direta de resolver essa questão é criar um ambiente de execução que
tenha níveis que espelhem os níveis de execução do código. Toda vez que um
procedimento for executado um novo nível no ambiente de execução é criado e o
procedimento será executado neste novo nível que foi criado. Evidentemente, esse
novo nível apontará para o nível que existia no momento em que ele foi criado.
Se for pedido um valor associado a um nome que não existe no nível atual do
ambiente de execução, esse valor será buscado nos níveis superiores, até que se
atinja o nível mais alto.

Para implementar o ambiente de execução dos programas do nosso interpretador,
vamos definir dois registro em Clojure: ~Binding~ e ~Env~.

*** Binding

Um ~Binding~ (amarração) é a estrutura de dados que está associada a um nome no
ambiente em que o código PL/0 estará sendo executado. Um ~Binding~ possui dois
campos:
- ~:kind~ -- o tipo de binding que está sendo criado (:var, :const, :proc)
- ~:value~ -- o valor que está associado ao binding


#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defrecord Binding [kind value])
#+end_src

Ao criar o registro ~Binding~ também são implicitamente definidas as funções
~->Binding~ e ~map->Binding~ para criação de objetos desse tipo.


*** Env

Um `Env` (environment/ambiente) é a estrutura de dados que irá armazenar
todas as informações necessárias para a execução do código dos programas
PL/0. Um `Env` possui dois campos:
- ~:bindings~ -- guarda todos os nomes definidos no ambiente. Cada nome está
  associado a um `Binding`.
- ~:parent~ -- guarda o ambiente pai do ambiente atual. Se este valor for ~nil~,
  significa que este ambiente é o ambiente raiz.


#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defrecord Env [bindings parent])

  (defn new-env
    "Cria um novo ambiente. Se não for especificado `parent`, é criado um ambiente
    raiz, caso contrário é criado um ambiente filho do ambiene indicado."
    ([] (->Env {} nil))
    ([parent] (->Env {} parent)))
#+end_src


Além das funções implicitamente definidas padrão, ~->Env~ e ~map->Env~, também
foi criada explicitamente uma função ~new-env~ para construção de um novo
ambiente sem nenhum /binding/.

Abaixo são definidas várias funções auxiliares para lidar com os ambientes de
execução.


#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defn is-defined?
    "Retorna `true` se o `name` estiver definido em `env`, e `false` caso contrário.
    Testa o ambiente no nível atuale toda a sequência de `parent` até o nível
    raiz."
    [env name]
    (or (contains? (:bindings env) name)
        (and (some? (:parent env)) (is-defined? (:parent env) name))))


  (defn def-name
    "Acrescenta uma definição do tipo (`kind`) indicado para `name` com o `value`
    indicado. Não valida se o valor é apropriado para o tipo informado."
    [env name kind value]
    (assoc-in env [:bindings name] (->Binding kind value)))

  (defn def-var [env name] (def-name env name :var nil))
  (defn def-const [env name value] (def-name env name :const value))
  (defn def-proc [env name body] (def-name env name :proc body))


  (defn set-var
    "Retorna um novo ambiente à partir de `env` com o valor `value` associado à
    variável `name`. Gera um erro se `name` não estiver definido ou se não for uma
    variável."
    [env name value]
    ;; (printf "(set-var %s %s %s)\n" env name value)
    (cond
      (some? (get-in env [:bindings name]))
      (let [v (get-in env [:bindings name])]
        (match [(:kind v)]
          [:var] (assoc-in env [:bindings name :value] value)
          [:const] (throw (ex-info (str "Name is a constante: " name) v))
          [:proc] (throw (ex-info (str "Name is a procedure: " name) v))))
      (some? (:parent env)) (assoc env :parent (set-var (:parent env) name value))
      :else (throw (ex-info (str "Undefined variable: " name) {}))))


  (defn get-value
    "Retorna o valor da variável ou constante `name` no ambiente `env`. Gera um
    erro se `name` não for definido, ou se não for uma variável ou uma constante."
    [env name]
    ;; (printf "(get-value %s %s)\n" env name)
    (cond
      (some? (get-in env [:bindings name]))
      (let [v (get-in env [:bindings name])]
        (match [(:kind v)]
          [:var] (:value v)
          [:const] (:value v)
          [:proc] (throw (ex-info (str "Name is a procedure: " name) v))))
      (some? (:parent env)) (recur (:parent env) name)
      :else (throw (ex-info (str "Undefined variable or constant: " name) {}))))


  (defn get-proc
    "Retorna a definição do procedimento `name` no ambiente `env`. Gera um erro se
    `name` não for definido, ou se não for um procedimento."
    [env name]
    (cond
      (some? (get-in env [:bindings name]))
      (let [v (get-in env [:bindings name])]
        (match [(:kind v)]
          [:var] (throw (ex-info (str "Name is a variable: " name) v))
          [:const] (throw (ex-info (str "Name is a constante: " name) v))
          [:proc] (:value v)))
      (some? (:parent env)) (get-proc (:parent env) name)
      :else (throw (ex-info (str "Procedure not defined: " name) {}))))
#+end_src


* Funções do Interpretador PL/0

Serão definidos dois tipos de função:
1. as funções ~exec~ são para execução de declarações e comandos e retornam
   ambientes;
2. as funções ~eval~ são para avaliação de condições e expresões e retornam o
   valor da condição ou expressão.

Como Clojure exige que a função seja definida -- ou ao menos declarada -- antes
de ser usada, faremos a declaração de todas as funções aqui e definiremos as
funções numa abordagem /top-down/.

#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (declare exec-block exec-decl exec-const-decl exec-var-decl
           exec-sttmt exec-progn exec-if exec-while
           eval-expr eval-cond eval-rel-expr)
#+end_src


