Teoria_da_Computacao/Trabalho/Trabalho1/pl0/pl0.org
** Funções que Executam Declarações e Comandos

A função ~exec~ é o ponto de entrada *principal* do interpretador. Ela recebe o
código fonte do programa PL/0 e interpreta o programa. A função exec passa o
código fonte PL/0 ao ~parser~, exctrai o AST, e passa esse AST à função
~exec-block~.

#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defn exec
    "Avalia o programa `prog` escrito em PL/0."
    [prog & {:keys [return-env] :or {return-env false}}]
    (let [env (-> prog
                  (parser)
                  (first)
                  (exec-block))]
      (if return-env env nil)))
#+end_src


a função ~exec-block~ processa a definição do programa principal, e também dos
procedimentos. Em PL/0 tanto o programa principal, quanto os procedimentos são
declarados como um bloco (=block=) na gramática. E um bloco é uma sequência de
declarações, opcionais, de constantes, variáveis, procedimentos, e um comando
(/statement/) obritatório ao final. As declarações de constantes, variáveis e
procedimentos apenas preparam o ambiente para a execução do comando ao final do
bloco.

#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defn exec-block
    "Avalia um bloco de código PL/0. Um bloco de código é uma sequência de
    declarações. A avaliação/execução de cada declaração pode gerar mudanças no
    ambiente de execução do programa."
    ([ast] (exec-block ast (new-env)))
    ([ast env]
     (match [ast]
       [[]] env
       [[:block & decls]] (recur decls env)
       [[d1 & ds]] (->> env
                        (exec-decl d1)
                        (recur ds)))))


  (defn exec-decl
    "Avalia/executa uma declaração de um bloco. Uma declaração pode ser: (i)
    declaração de constantes; (ii) declaração de variáveis; (iii) definição de
    procedimento; ou (iv) um `statement`."
    [decl env]
    (match [decl]
      ;; declaração de constantes
      [[:const_decl & const-inits]] (exec-const-decl const-inits env)
      ;; declaração de variáveis
      [[:var_decl & var-ids]] (exec-var-decl var-ids env)
      ;; declaração de procedimentos
      [[:proc_decl [:ident name] body]] (def-proc env name body)
      ;; statement
      [[:statement & _]] (exec-sttmt decl env)))


  (defn exec-var-decl
    "Atualiza o ambiente `env` com as definições das variáveis dadas em `idents`.
    Cria um novo ambiente, à partir de `env` em que as variáveis comos nomes dados
    em `idents` estão definidas. Retorna o novo ambiente."
    [idents env]
    (match [idents]
      [[]] env
      [[[:ident name] & idents1]]
      (->> (def-var env name)
           (recur idents1))))


  (defn exec-const-decl
    "Atualiza o ambiente `env` com as definições das constantes dadas em `inits`.
    Cria um novo ambiente, à partir de `env` em que as constantes comos nomes e
    valores dados em `inits` estão definidas. Retorna o novo ambiente."
    [inits env]
    (match [inits]
      [[]] env
      [[[:ident name] "=" [:number num] & inits1]]
      (->> (Integer/parseInt num)
           (def-const env name)
           (recur inits1))))
#+end_src


A função ~exec-sttmt~, que executa um comando, deve ser a última a ser chamada
ao se processar um bloco. Ela também é chamada recursivamente ao se processar
vários tipos de comandos, como o comando de sequência (=begin= ... =end=), o
comando condicional (=if= ... =then= ...) e o comando de repetição (=while= ...
=do= ...). Existem 7 tipos de comando em PL/0:
- *Atribuição:* associa à variável o valor indicado e retorna o novo ambiente
  resultante.
- *Chamada de procedimento:* cria um novo ambiente descendente do atual, executa
  o procedimento com o novo ambiente e retorna o ambiente no nível atual após a
  execução.
- *Entrada de dados:* Imprime o nome da variável como /prompt/. Lê um valor da
  entrada padrão. Atribui o valor à variável e retorna o ambiente resultante.
- *Saída de dados:* Calcula o valor da expressão indicada. Escreve o valor na
  saída padrão e retorna o ambiente atual.
- *Comando de sequência:* Executa os comandos indicados, em sequência. O
  primeiro comando é executado com o ambiente indicado. O ambiente retornado
  pelo primeiro comando é usado para executar o segundo comando. O ambiente
  retornado pelo segundo comando é usado para executar o terceiro comando e
  assim por diante. Retorna o ambiente retornado pelo último comando.
- *Comando condicional:* Avalia o valor da condição com o ambiente atual. Se o
  valor da condição for diferente de zero, executa o comando indicado com o
  ambiente atual e retorna o ambiente que o comando retornar. Caso contrário
  retorna o ambiente atual.
- *Comando de repetição:* Avalia o valor da condição com o ambiente atual. Se o
  valor da condição for zero, retorna o ambiente atual. Caso contrário, executa
  o comando indicado com o ambiente atual e usa o ambiente que o comando
  retornar para repetir o processo recursivamente.

#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (defn exec-sttmt
    "Executa um comando (statement) PL/0 e retorn o ambiente resultante."
    [sttmt env]
    ;; (printf "(exec-sttmt %s %s)\n" sttmt env)
    (match [sttmt]
      ;; atribuição
      [[:statement [:ident var] ":=" expr]]
      (let [value (eval-expr expr env)]
        (set-var env var value))
      ;; chamada de procedimento
      [[:statement "call" [:ident name]]]
      (-> (get-proc env name)
          (exec-block (new-env env))
          (get :parent))
      ;; Lê um valor para a variável
      [[:statement "?" [:ident name]]]
      (->> (do (printf "%s? " name)
               (flush)
               (read-line))
           (Integer/parseInt)
           (set-var env name))
      ;; Imprime o valor da expressão
      [[:statement "!" expr]]
      (do (->> (eval-expr expr env)
               (println))
          env)
      ;; Comando de sequência
      [[:statement "begin" & sttmt-seq]]
      (exec-progn sttmt-seq env)
      ;; condicional
      [[:statement "if" cond1 sttmt1]]
      (exec-if cond1 sttmt1 env)
      ;; repetição
      [[:statement "while" cond1 sttmt1]]
      (exec-while cond1 sttmt1 env)
      ;;
      ))


  (defn exec-progn
    "Executa os comandos em `sttmts` sequencialmente com o ambiente `env`. O
    primeiro comando é executado com `env`. O ambiente retornado pelo primeiro
    comando é usado para executar o segundo comando. O ambiente retornado pelo
    segundo comando é usado para executar o terceiro comando e assim por diante.
    Retorna o ambiente retornado pelo último comando."
    [sttmts env]
    ;; (printf "(exec-progn %s %s)\n" sttmts env)
    (match [sttmts]
      [[]] env
      [[stt1 & stts]]
      (->> (exec-sttmt stt1 env)
           (recur stts))))


  (defn exec-if
    "Avalia o valor de `cnd` com o ambiente `env`; se o valor for diferente de zero,
    executa `sttmt` usando `env` e retorna o ambiente resultante. Caso contrário
    retorna `env`."
    [cnd sttmt env]
    (let [cnd-val (eval-cond cnd env)]
      (if (zero? cnd-val)
        env
        (exec-sttmt sttmt env))))


  (defn exec-while
    "Avalia `cnd` em `env`; se o valor for zero, retorna `env`; caso contrário,
    executa `sttmt` em `env` e usa o ambiente resultante para repetir o processo
    recursivamente."
    [cnd sttmt env]
    (let [cnd-val (eval-cond cnd env)]
      (if (zero? cnd-val)
        env
        (->> (exec-sttmt sttmt env)
             (recur cnd sttmt)))))
#+end_src


