Teoria_da_Computacao/Trabalho/Trabalho1/pl0/pl0.org
** Funções que Avaliam Condições e Expressões

Quando se trata de avaliar expressões, algumas linguagens de programação são tão
“bem comportadas” assim. Em C, por exemplo, existem diversas formas de uma
expressão mudar o ambiente de execução, e.g., ~(x = 5) + y~, ~(x++ + --y)~, etc.
Para linguagens desse tipo são necessários mecanismos mais sofisticados de
interpretação. Em PL/0, felizmente, uma expressão não pode mudar o ambiente de
execução. Isso facilita o processo de interpretação.

No nosso interpretador, as funções que avaliam as condições e expressões recebem
a condição ou expressão a avaliar e o ambiente no qual será veita a avaliação, e
retornam o resultado da avaliação. Sempre considerando que o ambiente não muda
durante o processo de avaliação.

A avaliação é realizada de forma recursiva em uma estrutura descendente que
espelha a estrutura da gramática.


#+begin_src clojure +n :tangle ./src/ifes/pl0/core.clj
  (declare eval-term eval-factor)

  (defn eval-cond
    "Avalia a condição `cnd` de acrodo com as definições de `env` e retorna
    verdadeiro (1) ou falso (0). A condição pode ser `odd <expr>` ou `<expr> <op>
    <expr>`, onde `<op>` é um operador relacional."
    [cnd env]
    (match [cnd]
      [[:condition "odd" expr1]]
      (let [value (eval-expr expr1 env)]
        (mod value 2))
      [[:condition expr1 op expr2]]
      (eval-rel-expr expr1 op expr2 env)))


  (defn eval-rel-expr
    "Avalia uma expressão relacional com duas subexpressões, `expr1` e `expr2`, e um operador `op`
    relacional. Retorna 1 se a expressão for verdadeira e 0 caso contrário."
    [expr1 op expr2 env]
    (let [val1 (eval-expr expr1 env)
          val2 (eval-expr expr2 env)]
      (match [op]
        ["="] (if (= val1 val2) 1 0)
        [">"] (if (> val1 val2) 1 0)
        ["<"] (if (< val1 val2) 1 0)
        [(:or "<>" "#")] (if (not= val1 val2) 1 0)
        [">="] (if (>= val1 val2) 1 0)
        ["<="] (if (<= val1 val2) 1 0)
        ;;
        )))


  (defn eval-expr
    "Avalia a empressão `expr` no ambiente de execução `env`. Retorna o valor da
    expressão."
    ([expr env] (eval-expr expr nil env))
    ([expr acc env]
    (match [expr]
      [[]] acc
      [[:expression t1 & ts]] (let [v1 (eval-term t1 env)]
                                (eval-expr ts v1 env))
      [["+" t1 & ts]] (let [v1 (eval-term t1 env)]
                        (eval-expr ts (+ acc v1) env))
      [["-" t1 & ts]] (let [v1 (eval-term t1 env)]
                        (eval-expr ts (- acc v1) env)))))


  (defn eval-term
    "Avalia o termo `term` no ambiente de execução `env`. Retorna o valor do termo."
    ([term env] (eval-term term nil env))
    ([term acc env]
     (match [term]
       [[]] acc
       [[:term f1 & fs]] (let [v1 (eval-factor f1 env)]
                           (eval-term fs v1 env))
       [["*" f1 & fs]] (let [v1 (eval-factor f1 env)]
                         (eval-term fs (* acc v1) env))
       [["/" f1 & fs]] (let [v1 (eval-factor f1 env)]
                         (eval-term fs (quot acc v1) env)))))


  (defn eval-factor
    "Avalia o fator `factor` no ambiente de execução `env`. Retorna o valor do
    fator."
    [factor env]
    ;; (printf "(eval-factor %s %s)\n" factor env)
    (match [factor]
      [[:factor "+" f1]] (let [v1 (eval-factor f1 env)] v1)
      [[:factor "-" f1]] (let [v1 (eval-factor f1 env)] (- v1))
      [[:factor [:ident name]]] (get-value env name)
      [[:factor [:number n]]] (Integer/parseInt n)
      [[:factor [:expression & _]]] (eval-expr (nth factor 1) env)
      ;;
      ))
#+end_src


* Footnotes
[fn:3] Assim como de qualquer outra definida usando-se o Instaparse.

[fn:2] Depois que for feito o processo de =tangle=, isso não será muito
importante. Existirá um arquivo chamado ~pl0.clj~ com todo o código Clojure nele
e este será o arquivo usado pelo complilador para construir o programa.

[fn:1] A variável ~$PRJ~ será usada para indicar o diretório raiz do projeto.
